; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-6-4-23)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	p0-2 - location
	p0-5 - location
	p1-9 - location
	p2-4 - location
	p3-6 - location
	p3-7 - location
	p3-8 - location
	p4-3 - location
	p5-2 - location
	p5-3 - location
	p6-1 - location
	p6-2 - location
	p8-0 - location
	p8-2 - location
	p9-1 - location
	p9-3 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s0)
	(at driver3 s3)
	(at driver4 s6)
	(at driver5 s3)
	(at driver6 s4)
	(at truck1 s6)
	(empty truck1)
	(at truck2 s8)
	(empty truck2)
	(at truck3 s4)
	(empty truck3)
	(at truck4 s3)
	(empty truck4)
	(at package1 s4)
	(at package2 s0)
	(at package3 s2)
	(at package4 s9)
	(at package5 s8)
	(at package6 s3)
	(at package7 s7)
	(at package8 s8)
	(at package9 s4)
	(at package10 s8)
	(at package11 s8)
	(at package12 s6)
	(at package13 s2)
	(at package14 s6)
	(at package15 s7)
	(at package16 s6)
	(at package17 s2)
	(at package18 s2)
	(at package19 s7)
	(at package20 s9)
	(at package21 s1)
	(at package22 s4)
	(at package23 s9)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(path s3 p3-7)
	(path p3-7 s3)
	(path s7 p3-7)
	(path p3-7 s7)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-3)
	(path p5-3 s5)
	(path s3 p5-3)
	(path p5-3 s3)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s8 p8-0)
	(path p8-0 s8)
	(path s0 p8-0)
	(path p8-0 s0)
	(path s8 p8-2)
	(path p8-2 s8)
	(path s2 p8-2)
	(path p8-2 s2)
	(path s9 p9-3)
	(path p9-3 s9)
	(path s3 p9-3)
	(path p9-3 s3)
	(link s0 s1)
	(link s1 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s7)
	(link s7 s0)
	(link s0 s9)
	(link s9 s0)
	(link s1 s6)
	(link s6 s1)
	(link s1 s9)
	(link s9 s1)
	(link s2 s4)
	(link s4 s2)
	(link s2 s7)
	(link s7 s2)
	(link s2 s8)
	(link s8 s2)
	(link s4 s3)
	(link s3 s4)
	(link s5 s1)
	(link s1 s5)
	(link s5 s4)
	(link s4 s5)
	(link s5 s7)
	(link s7 s5)
	(link s5 s9)
	(link s9 s5)
	(link s6 s9)
	(link s9 s6)
	(link s7 s1)
	(link s1 s7)
	(link s7 s6)
	(link s6 s7)
	(link s7 s9)
	(link s9 s7)
	(link s8 s1)
	(link s1 s8)
	(link s8 s3)
	(link s3 s8)
	(link s8 s4)
	(link s4 s8)
	(link s8 s5)
	(link s5 s8)
	(link s9 s2)
	(link s2 s9)
	(link s9 s4)
	(link s4 s9)
)
	(:goal (and
	(at driver1 s8)
	(at driver3 s8)
	(at driver4 s6)
	(at driver5 s7)
	(at driver6 s7)
	(at truck2 s5)
	(at truck3 s6)
	(at truck4 s9)
	(at package1 s1)
	(at package2 s2)
	(at package3 s6)
	(at package4 s2)
	(at package5 s6)
	(at package6 s1)
	(at package8 s6)
	(at package9 s0)
	(at package10 s4)
	(at package11 s9)
	(at package12 s9)
	(at package13 s1)
	(at package14 s1)
	(at package15 s9)
	(at package16 s2)
	(at package17 s0)
	(at package18 s8)
	(at package19 s3)
	(at package20 s1)
	(at package22 s6)
	(at package23 s8)
	))


)

; plan
1. (board-truck driver4 s6 truck1)
   deleted: (at driver4 s6) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 0 of 29
2. (walk driver2 s0 p8-0)
   deleted: (at driver2 s0)
   added: (at driver2 p8-0)
   goals met: 0 of 29
3. (walk driver2 p8-0 s8)
   deleted: (at driver2 p8-0)
   added: (at driver2 s8)
   goals met: 0 of 29
4. (board-truck driver2 s8 truck2)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 0 of 29
5. (board-truck driver6 s4 truck3)
   deleted: (at driver6 s4) (empty truck3)
   added: (driving driver6 truck3)
   goals met: 0 of 29
6. (board-truck driver3 s3 truck4)
   deleted: (at driver3 s3) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 0 of 29
7. (load-truck s6 package16 truck1)
   deleted: (at package16 s6)
   added: (in package16 truck1)
   goals met: 0 of 29
8. (drive-truck driver4 s6 s7 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s7)
   goals met: 0 of 29
9. (drive-truck driver4 s7 s9 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s9)
   goals met: 0 of 29
10. (load-truck s9 package4 truck1)
   deleted: (at package4 s9)
   added: (in package4 truck1)
   goals met: 0 of 29
11. (load-truck s9 package23 truck1)
   deleted: (at package23 s9)
   added: (in package23 truck1)
   goals met: 0 of 29
12. (drive-truck driver4 s9 s2 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   goals met: 0 of 29
13. (unload-truck s2 package4 truck1)
   deleted: (in package4 truck1)
   added: (at package4 s2)
   goals met: 1 of 29
14. (load-truck s2 package3 truck1)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 1 of 29
15. (drive-truck driver4 s2 s7 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s7)
   goals met: 1 of 29
16. (load-truck s7 package19 truck1)
   deleted: (at package19 s7)
   added: (in package19 truck1)
   goals met: 1 of 29
17. (drive-truck driver4 s7 s6 truck1)
   deleted: (at truck1 s7)
   added: (at truck1 s6)
   goals met: 1 of 29
18. (unload-truck s6 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s6)
   goals met: 2 of 29
19. (drive-truck driver4 s6 s9 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s9)
   goals met: 2 of 29
20. (load-truck s9 package20 truck1)
   deleted: (at package20 s9)
   added: (in package20 truck1)
   goals met: 2 of 29
21. (drive-truck driver4 s9 s1 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s1)
   goals met: 2 of 29
22. (unload-truck s1 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s1)
   goals met: 3 of 29
23. (load-truck s8 package8 truck2)
   deleted: (at package8 s8)
   added: (in package8 truck2)
   goals met: 3 of 29
24. (load-truck s8 package5 truck2)
   deleted: (at package5 s8)
   added: (in package5 truck2)
   goals met: 3 of 29
25. (load-truck s8 package11 truck2)
   deleted: (at package11 s8)
   added: (in package11 truck2)
   goals met: 3 of 29
26. (drive-truck driver2 s8 s1 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s1)
   goals met: 3 of 29
27. (drive-truck driver2 s1 s6 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s6)
   goals met: 3 of 29
28. (drive-truck driver4 s1 s8 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s8)
   goals met: 3 of 29
29. (drive-truck driver4 s8 s2 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   goals met: 3 of 29
30. (load-truck s2 package18 truck1)
   deleted: (at package18 s2)
   added: (in package18 truck1)
   goals met: 3 of 29
31. (drive-truck driver4 s2 s8 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   goals met: 3 of 29
32. (unload-truck s8 package23 truck1)
   deleted: (in package23 truck1)
   added: (at package23 s8)
   goals met: 4 of 29
33. (unload-truck s8 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s8)
   goals met: 5 of 29
34. (drive-truck driver4 s8 s2 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s2)
   goals met: 5 of 29
35. (load-truck s2 package17 truck1)
   deleted: (at package17 s2)
   added: (in package17 truck1)
   goals met: 5 of 29
36. (drive-truck driver4 s2 s9 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s9)
   goals met: 5 of 29
37. (unload-truck s6 package8 truck2)
   deleted: (in package8 truck2)
   added: (at package8 s6)
   goals met: 6 of 29
38. (unload-truck s6 package5 truck2)
   deleted: (in package5 truck2)
   added: (at package5 s6)
   goals met: 7 of 29
39. (load-truck s6 package14 truck2)
   deleted: (at package14 s6)
   added: (in package14 truck2)
   goals met: 7 of 29
40. (drive-truck driver2 s6 s1 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s1)
   goals met: 7 of 29
41. (unload-truck s1 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s1)
   goals met: 8 of 29
42. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 9 of 29
43. (load-truck s4 package9 truck3)
   deleted: (at package9 s4)
   added: (in package9 truck3)
   goals met: 9 of 29
44. (drive-truck driver6 s4 s9 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s9)
   goals met: 9 of 29
45. (drive-truck driver2 s5 s4 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s4)
   goals met: 8 of 29
46. (load-truck s4 package22 truck2)
   deleted: (at package22 s4)
   added: (in package22 truck2)
   goals met: 8 of 29
47. (drive-truck driver2 s4 s9 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s9)
   goals met: 8 of 29
48. (unload-truck s9 package11 truck2)
   deleted: (in package11 truck2)
   added: (at package11 s9)
   goals met: 9 of 29
49. (drive-truck driver2 s9 s6 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s6)
   goals met: 9 of 29
50. (unload-truck s6 package22 truck2)
   deleted: (in package22 truck2)
   added: (at package22 s6)
   goals met: 10 of 29
51. (drive-truck driver2 s6 s7 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s7)
   goals met: 10 of 29
52. (load-truck s7 package15 truck2)
   deleted: (at package15 s7)
   added: (in package15 truck2)
   goals met: 10 of 29
53. (drive-truck driver2 s7 s5 truck2)
   deleted: (at truck2 s7)
   added: (at truck2 s5)
   goals met: 11 of 29
54. (drive-truck driver6 s9 s0 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s0)
   goals met: 11 of 29
55. (unload-truck s0 package9 truck3)
   deleted: (in package9 truck3)
   added: (at package9 s0)
   goals met: 12 of 29
56. (drive-truck driver6 s0 s7 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s7)
   goals met: 12 of 29
57. (drive-truck driver6 s7 s6 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s6)
   goals met: 13 of 29
58. (load-truck s6 package12 truck3)
   deleted: (at package12 s6)
   added: (in package12 truck3)
   goals met: 13 of 29
59. (drive-truck driver3 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 13 of 29
60. (load-truck s4 package1 truck4)
   deleted: (at package1 s4)
   added: (in package1 truck4)
   goals met: 13 of 29
61. (drive-truck driver3 s4 s8 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   goals met: 13 of 29
62. (load-truck s8 package10 truck4)
   deleted: (at package10 s8)
   added: (in package10 truck4)
   goals met: 13 of 29
63. (walk driver1 s2 p8-2)
   deleted: (at driver1 s2)
   added: (at driver1 p8-2)
   goals met: 13 of 29
64. (walk driver1 p8-2 s8)
   deleted: (at driver1 p8-2)
   added: (at driver1 s8)
   goals met: 14 of 29
65. (walk driver5 s3 p3-7)
   deleted: (at driver5 s3)
   added: (at driver5 p3-7)
   goals met: 14 of 29
66. (walk driver5 p3-7 s7)
   deleted: (at driver5 p3-7)
   added: (at driver5 s7)
   goals met: 15 of 29
67. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 14 of 29
68. (load-truck s0 package2 truck2)
   deleted: (at package2 s0)
   added: (in package2 truck2)
   goals met: 14 of 29
69. (drive-truck driver2 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 15 of 29
70. (drive-truck driver2 s5 s9 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s9)
   goals met: 14 of 29
71. (unload-truck s9 package15 truck2)
   deleted: (in package15 truck2)
   added: (at package15 s9)
   goals met: 15 of 29
72. (drive-truck driver2 s9 s2 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s2)
   goals met: 15 of 29
73. (unload-truck s2 package2 truck2)
   deleted: (in package2 truck2)
   added: (at package2 s2)
   goals met: 16 of 29
74. (load-truck s2 package13 truck2)
   deleted: (at package13 s2)
   added: (in package13 truck2)
   goals met: 16 of 29
75. (drive-truck driver2 s2 s9 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s9)
   goals met: 16 of 29
76. (drive-truck driver2 s9 s1 truck2)
   deleted: (at truck2 s9)
   added: (at truck2 s1)
   goals met: 16 of 29
77. (unload-truck s1 package13 truck2)
   deleted: (in package13 truck2)
   added: (at package13 s1)
   goals met: 17 of 29
78. (drive-truck driver2 s1 s5 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   goals met: 18 of 29
79. (drive-truck driver6 s6 s9 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s9)
   goals met: 17 of 29
80. (unload-truck s9 package12 truck3)
   deleted: (in package12 truck3)
   added: (at package12 s9)
   goals met: 18 of 29
81. (drive-truck driver6 s9 s6 truck3)
   deleted: (at truck3 s9)
   added: (at truck3 s6)
   goals met: 19 of 29
82. (drive-truck driver3 s8 s4 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s4)
   goals met: 19 of 29
83. (unload-truck s4 package10 truck4)
   deleted: (in package10 truck4)
   added: (at package10 s4)
   goals met: 20 of 29
84. (drive-truck driver3 s4 s8 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   goals met: 20 of 29
85. (drive-truck driver3 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 20 of 29
86. (unload-truck s1 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   goals met: 21 of 29
87. (drive-truck driver3 s1 s8 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   goals met: 21 of 29
88. (drive-truck driver3 s8 s3 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   goals met: 21 of 29
89. (load-truck s3 package6 truck4)
   deleted: (at package6 s3)
   added: (in package6 truck4)
   goals met: 21 of 29
90. (drive-truck driver3 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 21 of 29
91. (drive-truck driver3 s4 s8 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   goals met: 21 of 29
92. (drive-truck driver3 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 21 of 29
93. (drive-truck driver4 s9 s2 truck1)
   deleted: (at truck1 s9)
   added: (at truck1 s2)
   goals met: 21 of 29
94. (unload-truck s2 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s2)
   goals met: 22 of 29
95. (drive-truck driver4 s2 s8 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s8)
   goals met: 22 of 29
96. (drive-truck driver4 s8 s3 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s3)
   goals met: 22 of 29
97. (unload-truck s3 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s3)
   goals met: 23 of 29
98. (disembark-truck driver4 s3 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s3) (empty truck1)
   goals met: 23 of 29
99. (walk driver4 s3 p3-6)
   deleted: (at driver4 s3)
   added: (at driver4 p3-6)
   goals met: 23 of 29
100. (walk driver4 p3-6 s6)
   deleted: (at driver4 p3-6)
   added: (at driver4 s6)
   goals met: 24 of 29
101. (drive-truck driver3 s1 s8 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s8)
   goals met: 24 of 29
102. (unload-truck s3 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s3)
   goals met: 24 of 29
103. (drive-truck driver3 s8 s3 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   goals met: 24 of 29
104. (load-truck s3 package17 truck4)
   deleted: (at package17 s3)
   added: (in package17 truck4)
   goals met: 24 of 29
105. (drive-truck driver3 s3 s4 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s4)
   goals met: 24 of 29
106. (drive-truck driver3 s4 s8 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s8)
   goals met: 24 of 29
107. (drive-truck driver3 s8 s1 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s1)
   goals met: 24 of 29
108. (drive-truck driver3 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 24 of 29
109. (unload-truck s0 package17 truck4)
   deleted: (in package17 truck4)
   added: (at package17 s0)
   goals met: 25 of 29
110. (disembark-truck driver3 s0 truck4)
   deleted: (driving driver3 truck4)
   added: (at driver3 s0) (empty truck4)
   goals met: 25 of 29
111. (walk driver3 s0 p8-0)
   deleted: (at driver3 s0)
   added: (at driver3 p8-0)
   goals met: 25 of 29
112. (walk driver3 p8-0 s8)
   deleted: (at driver3 p8-0)
   added: (at driver3 s8)
   goals met: 26 of 29
113. (unload-truck s0 package6 truck4)
   deleted: (in package6 truck4)
   added: (at package6 s0)
   goals met: 26 of 29
114. (drive-truck driver2 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 25 of 29
115. (load-truck s0 package6 truck2)
   deleted: (at package6 s0)
   added: (in package6 truck2)
   goals met: 25 of 29
116. (drive-truck driver2 s0 s1 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s1)
   goals met: 25 of 29
117. (unload-truck s1 package6 truck2)
   deleted: (in package6 truck2)
   added: (at package6 s1)
   goals met: 26 of 29
118. (drive-truck driver2 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 26 of 29
119. (disembark-truck driver2 s0 truck2)
   deleted: (driving driver2 truck2)
   added: (at driver2 s0) (empty truck2)
   goals met: 26 of 29
120. (board-truck driver2 s0 truck4)
   deleted: (at driver2 s0) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 26 of 29
121. (drive-truck driver2 s0 s9 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s9)
   goals met: 27 of 29
122. (walk driver3 s8 p8-0)
   deleted: (at driver3 s8)
   added: (at driver3 p8-0)
   goals met: 26 of 29
123. (walk driver3 p8-0 s0)
   deleted: (at driver3 p8-0)
   added: (at driver3 s0)
   goals met: 26 of 29
124. (board-truck driver3 s0 truck2)
   deleted: (at driver3 s0) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 26 of 29
125. (drive-truck driver3 s0 s5 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s5)
   goals met: 27 of 29
126. (disembark-truck driver2 s9 truck4)
   deleted: (driving driver2 truck4)
   added: (at driver2 s9) (empty truck4)
   goals met: 27 of 29
127. (walk driver2 s9 p9-3)
   deleted: (at driver2 s9)
   added: (at driver2 p9-3)
   goals met: 27 of 29
128. (walk driver2 p9-3 s3)
   deleted: (at driver2 p9-3)
   added: (at driver2 s3)
   goals met: 27 of 29
129. (walk driver2 s3 p3-7)
   deleted: (at driver2 s3)
   added: (at driver2 p3-7)
   goals met: 27 of 29
130. (walk driver2 p3-7 s7)
   deleted: (at driver2 p3-7)
   added: (at driver2 s7)
   goals met: 27 of 29
131. (drive-truck driver6 s6 s7 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s7)
   goals met: 26 of 29
132. (disembark-truck driver6 s7 truck3)
   deleted: (driving driver6 truck3)
   added: (at driver6 s7) (empty truck3)
   goals met: 27 of 29
133. (board-truck driver2 s7 truck3)
   deleted: (at driver2 s7) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 27 of 29
134. (drive-truck driver2 s7 s6 truck3)
   deleted: (at truck3 s7)
   added: (at truck3 s6)
   goals met: 28 of 29
135. (disembark-truck driver2 s6 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s6) (empty truck3)
   goals met: 28 of 29
136. (walk driver2 s6 p3-6)
   deleted: (at driver2 s6)
   added: (at driver2 p3-6)
   goals met: 28 of 29
137. (walk driver2 p3-6 s3)
   deleted: (at driver2 p3-6)
   added: (at driver2 s3)
   goals met: 28 of 29
138. (walk driver2 s3 p3-8)
   deleted: (at driver2 s3)
   added: (at driver2 p3-8)
   goals met: 28 of 29
139. (walk driver2 p3-8 s8)
   deleted: (at driver2 p3-8)
   added: (at driver2 s8)
   goals met: 28 of 29
140. (drive-truck driver3 s5 s8 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   goals met: 27 of 29
141. (disembark-truck driver3 s8 truck2)
   deleted: (driving driver3 truck2)
   added: (at driver3 s8) (empty truck2)
   goals met: 28 of 29
142. (board-truck driver2 s8 truck2)
   deleted: (at driver2 s8) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 28 of 29
143. (drive-truck driver2 s8 s5 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   goals met: 29 of 29
